Wind_Dune_Egmond/run_angle80/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    #include "include/fixedInlet"

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ground
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    /*motorBikeGroup
    {
        type            omegaWallFunction;
        value           $internalField;
    }*/

	front    // mesle inlet ast
	{
    
	type            cyclic;
	
	
	//type slip;     
	
	/*type  fixedValue;
    value $internalField;*/
		
	}

	Back        
	{
    
	
	type            cyclic;
	
	//type slip;
	
	/*type            inletOutlet;
    inletValue      $internalField;
    value           $internalField;*/
	
	}


    #include "include/frontBackUpperPatches"
}


// ************************************************************************* //
